import React from "react";

const Page: React.FC = () => {
  return (
    <>
      <div className="px-2">
        <h1 className="text-center text-2xl mb-5">
          Політика користування сайтом
        </h1>
        <h2 className="text-base mb-1">
          1. Вступ Ласкаво просимо на наш сайт!
        </h2>
        <p className="text-sm mb-3 ml-5">
          Використовуючи цей веб-сайт, ви погоджуєтеся дотримуватись умов,
          викладених у цій Політиці користування сайтом. Якщо ви не згодні з
          будь-яким із пунктів, будь ласка, припиніть використання сайту.
        </p>
        <h2 className="text-base mb-1">2. Використання сайту</h2>
        <p className="ml-5 mb-1">
          2.1. Дозволені дії Ви можете переглядати, завантажувати та зберігати
          матеріали сайту виключно для особистого та некомерційного
          використання. Ви можете ділитися посиланнями на наш сайт за умови, що
          це робиться чесно і не шкодить нашій репутації.
        </p>
        <p className="ml-5 mb-3">
          2.2. Заборонені дії Використовувати сайт для будь-яких незаконних або
          шахрайських цілей. Завантажувати шкідливий контент, зокрема віруси або
          інший код, що може завдати шкоди сайту чи іншим користувачам.
          Втручатися в роботу сайту, порушувати безпеку чи отримувати
          несанкціонований доступ до даних. Використовувати контент сайту без
          нашої попередньої письмової згоди для комерційних цілей.
        </p>
        <h2 className="text-base mb-1">3. Інтелектуальна власність</h2>
        <p className="ml-5 mb-3">
          Увесь контент сайту (тексти, зображення, відео, логотипи тощо) є нашою
          власністю або використовується з дозволу третіх сторін. Забороняється
          копіювати, змінювати, поширювати чи використовувати контент без
          попереднього дозволу.
        </p>
        <h2 className="text-base mb-1">4. Реєстрація та облікові записи</h2>
        <p className="ml-5 mb-1">
          4.1. Обов’язки користувача Ви зобов’язані надавати достовірну
          інформацію під час реєстрації. Ви несете відповідальність за
          збереження конфіденційності ваших облікових даних. Ви зобов’язані
          негайно повідомити нас про будь-яке несанкціоноване використання
          вашого акаунту.
        </p>
        <p className="ml-5 mb-3">
          4.2. Закриття акаунту Ми залишаємо за собою право закрити ваш акаунт у
          випадку порушення вами цієї Політики.
        </p>
        <h2 className="text-base mb-1">5. Відмова від відповідальності</h2>
        <p className="ml-5 mb-3">
          Сайт надається "як є" без будь-яких гарантій. Ми не несемо
          відповідальності за можливі помилки, перебої в роботі. Ми не
          гарантуємо, що сайт буде відповідати вашим очікуванням або працювати
          без помилок.
        </p>
        <h2 className="text-base mb-1">6. Зміни до політики</h2>
        <p className="ml-5 mb-3">
          Ми залишаємо за собою право в будь-який час оновлювати або змінювати
          цю Політику користування. Усі зміни набувають чинності з моменту їх
          публікації на сайті. Рекомендуємо періодично переглядати цю сторінку
          для ознайомлення з оновленнями.
        </p>
        <h2 className="text-base mb-1"> 7. Контактна інформація</h2>
        <p className="ml-5 mb-3">
          Якщо у вас виникли запитання або ви хочете подати скаргу, будь ласка,
          зв’яжіться з нами: Електронна пошта: [ваш email] Телефон: [ваш номер
          телефону] Дякуємо, що користуєтесь нашим сайтом!
        </p>
      </div>
    </>
  );
};

export default Page;
